Documents/ПоступлениеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПоступлениеСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГашениеКредита</Name>
					<Comment>если приход в кредитный кошелек</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДРГашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>для недельного планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетГод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтрагентыПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыПоСтатьям</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтразитьВНакопленияхПриИзменении(Элемент)
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКлиент()

	Элементы.Группа3.Видимость = Объект.ГашениеКредита;
	Элементы.ГашениеКредита.Видимость = Объект.ГашениеКредита;
	Элементы.СтатьяДРГашение.Видимость = Объект.ГашениеКредита;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуЗапретаРедактирования()

	Возврат Константы.ДатаЗапретаРедактирования.Получить();

КонецФункции // ПолучитьДатуЗапретаРедактирования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКлиент();
	Если НачалоДня(Объект.Дата)<=ПолучитьДатуЗапретаРедактирования() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта = ПолучитьВалютуРеглУчетаСервер();
		ВалютаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	//Если НЕ ЗначениеЗаполнено(Объект.Курс) Тогда
		Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
		Объект.Курс = Курс.Курс;
		Объект.Кратность = Курс.Кратность;
	//КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуРеглУчетаСервер()
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
КонецФункции
                                       
&НаКлиенте
Процедура ОтразитьВКредитахПриИзменении(Элемент)
	Если НЕ Объект.ОтразитьВКредитах Тогда
		Объект.СтатьяДРГашение = "";
		Объект.ГашениеКредита = Ложь;
	КонецЕсли;
	УправлениеВидимостьюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДРПриИзменении(Элемент)
	//выбрать контрагента
	ИзменитьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКонтрагента()
	//выбрать контрагента
	ИзменитьКонтрагентаС();
КонецПроцедуры

&НаСервере
Процедура ИзменитьКонтрагентаС()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыПоСтатьямСрезПоследних.Контрагент
		|ИЗ
		|	РегистрСведений.КонтрагентыПоСтатьям.СрезПоследних(&Период, СтатьяДР = &СтатьяДР) КАК КонтрагентыПоСтатьямСрезПоследних";

	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СтатьяДР", Объект.СтатьяДР);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Прервать;
	КонецЦикла;

КонецПроцедуры
